# IsSet Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundingBoxUV..::..IsSet Property
BoundingBoxUV Class See Also
---
Indicates whether the BoundingBoxUV is set or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public bool IsSet { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsSet As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsSet {
	bool get ();
}
```

# Remarks
An unset BoundingBoxUV has its lower-left corner to the right of (and above) its upper-right corner (this is an arbitrary internal representation). It means that it is empty and has never been initialized. If someone using the API creates a Plane via one of the Plane.Create() methods, for example, the Plane will not have its envelope set, so Surface.GetBoundingBoxUV() would return an empty BoundingBoxUV.
# See Also
BoundingBoxUV Class
Autodesk.Revit.DB Namespace